---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.AnalyticalLoopType.All
enum: Autodesk.Revit.DB.Structure.AnalyticalLoopType
source: html/e19a91b9-b428-11a1-61a7-55296df56c2e.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalLoopType.All

All analytical loops of analytical model surface elements (floor, slab, wall).